//
// Created by user on 2026/3/8.
//

#ifndef DOBBY_PROJECT_LOLOFFSET_H
#define DOBBY_PROJECT_LOLOFFSET_H

namespace lol {

    struct FrameEngine_Common_LayoutDump_Fields {
    };
    struct FrameEngine_Common_LayoutDump_VTable {
        VirtualInvokeData _0_dummy;
    };
    struct FrameEngine_Common_LayoutDump_c {
        Il2CppClass_1 _1;
        struct FrameEngine_Common_LayoutDump_StaticFields *static_fields;
        Il2CppRGCTXData *rgctx_data;
        Il2CppClass_2 _2;
        FrameEngine_Common_LayoutDump_VTable vtable;
    };
    struct FrameEngine_Common_LayoutDump_o {
        FrameEngine_Common_LayoutDump_c *klass;
        void *monitor;
        FrameEngine_Common_LayoutDump_Fields fields;
    };
    struct FrameEngine_Common_LayoutDump_StaticFields {
        int32_t FixTime_FrameCount_offset; // 0x0
        int32_t FixTime_FrameRate_offset; // 0x0
        int32_t FixTime_size; // 0x0
        int32_t FixTime_Time_offset; // 0x0
        int32_t FixTime_vfptr_offset; // 0x0
        int32_t FixTimeSync_FrameCount_offset; // 0x0
        int32_t FixTimeSync_FrameRate_offset; // 0x0
        int32_t FixTimeSync_size; // 0x0
        int32_t FixTimeSync_Time_offset; // 0x0
        int32_t FixTimeSync_vbptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorSource_m_variables_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorSource_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorSource_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorStr128_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorStr128_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorStr256_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorStr256_str_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BehaviorStr256_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_ExecutionStatus_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_InterruptTime_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_IsReevaluating_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_PopTime_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_PushTime_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_ReferenceID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_BevNodeData_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevActor_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevActor_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevActor_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevActorList_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevActorList_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevActorList_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevInput_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevInput_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBevInput_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBool_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBool_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBool_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedBool_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64List_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64List_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64List_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixed64List_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector2_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector2_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector2_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector2_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector3_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector3_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector3_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedFixedVector3_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedGenericVariable_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedGenericVariable_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedGenericVariable_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedGenericVariable_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedInt_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedInt_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedInt_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedInt_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedIntList_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedIntList_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedIntList_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedIntList_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedNamedVariable_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedNamedVariable_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedNamedVariable_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedNamedVariable_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedString_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedString_mValue_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedString_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedString_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedVariable_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedVariable_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SharedVariable_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_ShareTeamAiBevInput_mNameID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_ShareTeamAiBevInput_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_ShareTeamAiBevInput_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_debugList_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_m_actorID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_m_resID_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_m_source_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_m_treeName_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTree_vfptr_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTreeMgr_m_runningTreeList_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTreeMgr_m_treeDictionary_offset; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTreeMgr_size; // 0x0
        int32_t FrameEngine_BehaviorDesigner_SimpleBevTreeMgr_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ActivateSkillCastParam_lackConsumeCD_offset; // 0x0
        int32_t FrameEngine_Common_ActivateSkillCastParam_size; // 0x0
        int32_t FrameEngine_Common_ActivateSkillCastParam_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_activitiesNodeList_offset; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_defaultActive_offset; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_eGameModes_offset; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_name_offset; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_size; // 0x0
        int32_t FrameEngine_Common_ActivitiesResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AFKResObject_afkConfigResObjectList_offset; // 0x0
        int32_t FrameEngine_Common_AFKResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AFKResObject_size; // 0x0
        int32_t FrameEngine_Common_AFKResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AICherryCtrlCfgResObject_aiCherryCtrlCfgList_offset; // 0x0
        int32_t FrameEngine_Common_AICherryCtrlCfgResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AICherryCtrlCfgResObject_size; // 0x0
        int32_t FrameEngine_Common_AICherryCtrlCfgResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AICtrlCfgResObject_aiCtrlCfgList_offset; // 0x0
        int32_t FrameEngine_Common_AICtrlCfgResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AICtrlCfgResObject_size; // 0x0
        int32_t FrameEngine_Common_AICtrlCfgResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AIEffectConfigResObject_aiEffectConfigList_offset; // 0x0
        int32_t FrameEngine_Common_AIEffectConfigResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AIEffectConfigResObject_size; // 0x0
        int32_t FrameEngine_Common_AIEffectConfigResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_commonChooseForgingProb_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_foringProb_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_idleAIRankWeight_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_inGroupConfig_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_interactiveConfig_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_isBraveChooseForgingProb_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_isUseForgingChooseForgingProb_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_replyInteractiveProb_offset; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_size; // 0x0
        int32_t FrameEngine_Common_AIGlobalSettingResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AIHeroOrientationResObject_aiHeroOrientationList_offset; // 0x0
        int32_t FrameEngine_Common_AIHeroOrientationResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AIHeroOrientationResObject_MaxOrientationNum_offset; // 0x0
        int32_t FrameEngine_Common_AIHeroOrientationResObject_size; // 0x0
        int32_t FrameEngine_Common_AIHeroOrientationResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AISkillDamageTriggerTimeResObject_aiSkillDamageTriggerTimeList_offset; // 0x0
        int32_t FrameEngine_Common_AISkillDamageTriggerTimeResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AISkillDamageTriggerTimeResObject_MaxHurtIDNum_offset; // 0x0
        int32_t FrameEngine_Common_AISkillDamageTriggerTimeResObject_size; // 0x0
        int32_t FrameEngine_Common_AISkillDamageTriggerTimeResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLabelConfResObject_aiSkillLabelConfList_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLabelConfResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLabelConfResObject_MaxLabelNum_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLabelConfResObject_size; // 0x0
        int32_t FrameEngine_Common_AISkillLabelConfResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLearnSeqResObject_aiSkillLearnSeqList_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLearnSeqResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AISkillLearnSeqResObject_size; // 0x0
        int32_t FrameEngine_Common_AISkillLearnSeqResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AISkillToMonsterResObject_aiSkillToMonsterList_offset; // 0x0
        int32_t FrameEngine_Common_AISkillToMonsterResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AISkillToMonsterResObject_size; // 0x0
        int32_t FrameEngine_Common_AISkillToMonsterResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AssetObject_path_offset; // 0x0
        int32_t FrameEngine_Common_AssetObject_size; // 0x0
        int32_t FrameEngine_Common_AssetObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AttrDescResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AttrDescResObject_size; // 0x0
        int32_t FrameEngine_Common_AttrDescResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitData_id_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitData_max_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitData_min_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitData_size; // 0x0
        int32_t FrameEngine_Common_AttrLimitData_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitResObject_limitAttrs_offset; // 0x0
        int32_t FrameEngine_Common_AttrLimitResObject_size; // 0x0
        int32_t FrameEngine_Common_AttrLimitResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BackHomeLogicInvalidPlayModeResObject_ePlayModes_offset; // 0x0
        int32_t FrameEngine_Common_BackHomeLogicInvalidPlayModeResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BackHomeLogicInvalidPlayModeResObject_size; // 0x0
        int32_t FrameEngine_Common_BackHomeLogicInvalidPlayModeResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_barracksID_offset; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_camp_offset; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_line_offset; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_size; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_summonerID_offset; // 0x0
        int32_t FrameEngine_Common_BarracksResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_privateBuffs_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_privateBullets_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_privateMarks_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_privateMonsters_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_privateSkills_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_size; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_variables_offset; // 0x0
        int32_t FrameEngine_Common_BaseChampionResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_actorType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_targetType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorTypeRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_actorVarEnum_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionActorVarEnumRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionBaseRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionBaseRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionBaseRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionBaseRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionBaseRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionBaseRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_cdType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionCDRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_attrType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_monsterType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionChangeAttrRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_damageFixType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionDamageRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_dieAwardType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionDieAwardRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_battleModeConfigType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionModeRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_subType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionMonsterSubTypeRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_consumeType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillConsumeTypeRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_skillCreateType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillCreateTypeRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_funcType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionSkillFuncTypeRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_combine_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_conditionType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_isInverse_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_size; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_treatType_offset; // 0x0
        int32_t FrameEngine_Common_BattleConditionTreatRes_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventAssetObject_res_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventAssetObject_resID_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventAssetObject_size; // 0x0
        int32_t FrameEngine_Common_BattleEventAssetObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventConditionResObject_battleEventConditionInfoList_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventConditionResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventConditionResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleEventConditionResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_eGameModes_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_flow1_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_flow2_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_flow3_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_Heros1_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_Heros2_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_triggerRate_offset; // 0x0
        int32_t FrameEngine_Common_BattleEventResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_addRefreshCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_attackSpeedToFlowSpeedRate_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_audioSwitchGroup_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_audioSwitchState1_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_audioSwitchState2_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_audioSwitchState3_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_audioSwitchState4_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_backHomeLogicInvalidPlayModeRes_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_baronBuff_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_baronSoldierDmgFixBuff_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_barracksRes_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_baseBornFlowVisi_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_battleKeyInfoFloorLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_battleKeyInfoUpperLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_canAccumulateRefreshCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryEquipForgeCanAccumulateRfreshCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryEquipForgeRefreshCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryGainInitRefreshCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryGameplayComponentIds_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryGameplayComponentProbs_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryHatBuffId_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryTeamInitHp_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryTeamMatchExtraWeight_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryTeamMatchInitWeight_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cherryTeamMatchRandomWeight_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cppHotFix_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_cStrengthRecoverInterval_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_defaultWeight_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_delayBeforeDeleash_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_delayBeforeDeleashBaron_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_disguiseTailTriggerCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_disguiseTailValidDuration_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_extraGoldResConfig_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_globalHeroBuffs_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_grassAudioRange_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_heroDieVfxBlue_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_heroDieVfxPlaySpeed_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_heroDieVfxRed_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_hexPathGainLimitSelectTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_hexPathGainList_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_honorMinValueList_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_iActiveAdvancedEquipCDTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_iEquipRecommendationCDTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_iEquipSaleByRawPriceBuffTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_iMaxSoilderNum_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_isIgnoreFactor_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_isMultiCampMode_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_isMultiMapMode_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_iStopCreateSoilderTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_iSurrenderCloseUITime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_maxBulletMultiSpeedScale_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_maxGainCountInShow_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_maxRefreshCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_mergeDesc_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_mergeDescParams_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_mergeName_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_mergeNameParams_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_minBulletMultiSpeedScale_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_moveSpeedFactor1_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_moveSpeedFactor2_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_moveSpeedFactor3_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_moveSpeedValue1_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_moveSpeedValue2_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_moveSpeedValue3_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_plantEyeVfx_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_playSpecialBornFlowTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_possessFinishDelayDestoryTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_recallStrengthenBuffs_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_reflectSkillDelayDestroyTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_ruinEquipBulkMinValue_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_ruinEquipBulkRoundFactor_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_ruinEquipFirstFactor_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_ruinEquipGoodsCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_ruinRefreshSkillMaxCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_ruinSkillGoodsCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_scDamageModified_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_slowSpeedRateFactor2_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_soilderBeheadApMaxAddHurt_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_soilderBeheadApToOneHurt_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_soldierBornVfx_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_soldierQuickConfig_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_specialBornFlowVisi_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_stateChangeInterval_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_stateZeroRecoverIntervalList_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_strengthMax_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_stringCacheRes_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_timeOutIndex_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_towerADBuff_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_towerAPBuff_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_towerWarmupTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_usbMatBuff_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_VisibleComp_Nearsight_Hotfix_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_wardSkillConfig_offset; // 0x0
        int32_t FrameEngine_Common_BattleGlobalSettingResObject_watchTimeLineIcons_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_battleDataCollectInfoList_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_cannonHitEnemyLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_cannonUseEnemyLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_heroSkillHitCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_heroSkillHitLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_normalSkillHitCount_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_normalSkillHitLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_snowballDashUseLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_snowballDashUseNoDeathLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_snowballFlyDistance_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_specialActivityEnterSpringTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_specialActivitySpeed_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_specialActivityStayInGrassTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_summonerSpellKillLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_useSkill4HitMultiNum_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_useSKill4KillLimitTime_offset; // 0x0
        int32_t FrameEngine_Common_BattleScoringDataCollectResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleShopReplaceResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleShopReplaceResObject_replaceEquipArray_offset; // 0x0
        int32_t FrameEngine_Common_BattleShopReplaceResObject_replaceModeId_offset; // 0x0
        int32_t FrameEngine_Common_BattleShopReplaceResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleShopReplaceResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleSpecialEventAssemblyResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleSpecialEventAssemblyResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleSpecialEventAssemblyResObject_specialEventList_offset; // 0x0
        int32_t FrameEngine_Common_BattleSpecialEventAssemblyResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_battleTaskType_offset; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_iParam1_offset; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_iParam2_offset; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_iParam3_offset; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_size; // 0x0
        int32_t FrameEngine_Common_BattleTaskResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BestPartnerResObject_bestPartnerList_offset; // 0x0
        int32_t FrameEngine_Common_BestPartnerResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BestPartnerResObject_size; // 0x0
        int32_t FrameEngine_Common_BestPartnerResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffAssetObject_res_offset; // 0x0
        int32_t FrameEngine_Common_BuffAssetObject_resID_offset; // 0x0
        int32_t FrameEngine_Common_BuffAssetObject_size; // 0x0
        int32_t FrameEngine_Common_BuffAssetObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffLevelData_duration_offset; // 0x0
        int32_t FrameEngine_Common_BuffLevelData_flow_offset; // 0x0
        int32_t FrameEngine_Common_BuffLevelData_hurtOriSkillAsset_offset; // 0x0
        int32_t FrameEngine_Common_BuffLevelData_size; // 0x0
        int32_t FrameEngine_Common_BuffLevelData_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffRelationResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BuffRelationResObject_relations_offset; // 0x0
        int32_t FrameEngine_Common_BuffRelationResObject_size; // 0x0
        int32_t FrameEngine_Common_BuffRelationResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_assistKillFlag_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_autoStackStep_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_autoStackTimeF_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_buffInjuryInterval_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_buffOptTypeWhenRide_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_buffPhaseTipsInfos_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_buffType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_compAsset_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_desc_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_displayPriority_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_displayType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_effectData_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_endOfTheDelay_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_enterFightType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_executeDisplayPercent_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_executePercent_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_exposedVisualField_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_filter_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_filterAsset_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_flyTextIcon_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_flyTextVisibility_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_freeskillFinishRemoveType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_gainskillFinishRemoveType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_groupID_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_groupPriority_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_hideHudProgressBar_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_hudText_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_icon_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_ignoreKnockTenacity_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_ignoreTenacity_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isAINeddBuff_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isBanPosture_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isCdBuff_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isHexCdBuff_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isPassive_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isRedBorder_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isSpecialParseDesc_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isTerrainWallDisplay_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isUniqueSkillGuid_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_isUseFlyTextCurve_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_keepUponDeadToZombie_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_levelData_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_markStyle_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_maxLevel_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_mergeType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_name_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_needCloneBuff_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_notRemoveAniWhenFakeDeath_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_notRemoveUponDeath_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_ownerSkill_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_passiveMoveCanAffectFlowSpeed_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_possessionFinishRemoveType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_possessionTransfer_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_recreationBuffType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_reflectTransfer_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_removeUponFakeDeath_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_removeWhenGiverDie_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_roundChangeRemoveType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_size; // 0x0
        int32_t FrameEngine_Common_BuffResObject_skillVarAsset_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_stackCount_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_stackReduceStep_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_stackReduceTimeF_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_stackType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_summonerDebuffAssist_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_uiHeadBarType_offset; // 0x0
        int32_t FrameEngine_Common_BuffResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffTipsInfo_buffStackDescList_offset; // 0x0
        int32_t FrameEngine_Common_BuffTipsInfo_displayType_offset; // 0x0
        int32_t FrameEngine_Common_BuffTipsInfo_size; // 0x0
        int32_t FrameEngine_Common_BuffTipsInfo_szBaseParam_offset; // 0x0
        int32_t FrameEngine_Common_BuffTipsInfo_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupAssetObject_resID_offset; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupAssetObject_size; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupAssetObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupResObject_buffTypeFlags_offset; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupResObject_size; // 0x0
        int32_t FrameEngine_Common_BuffTypeGroupResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_acceleration_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_aliveTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_assetBullet_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_audioDisMod_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_borderCheck_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_bulletFadeInTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_checkObstruct_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_checkTerrainWall_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_delayDeleteTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_destroyBox_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_destroyGrass_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_detectBlockUseHitFilter_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_displayInMinMap_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_distanceLimit_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_distancWithSkillChange_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_fixedForwardY_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_fowFadeTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitActorFilter_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitByDistanceSort_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitExpirationTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitFinishActorCount_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitFinishActorFilter_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitSceneHandler_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitScreenShake_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitSound_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitTimesLimit_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hitVisionTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hurtJoint_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_hurtJointGroup_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreAliveTimeExtra_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreHitActorDirCheck_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreLevelRuleFix_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreParry_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreReflect_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreSpecificBlocks_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreSpeedScale_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_ignoreTargetRadius_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_isGetParentSpeedScale_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_isHorizontalSpeed_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_isImmortal_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_MinMapIcon_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_onlyShowToCaster_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_openFirstTickCheck_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_openVisiDistanceLimit_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_path_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_realmFollowType_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_reflectBulletEmitterType_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_reflectEmitType_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_reflectForwardType_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_shape_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_shapeParam1_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_shapeParam2_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_showInFog_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_showSkinHitAudio_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_showWithActorVisable_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_sightIgnoreBlock_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_size; // 0x0
        int32_t FrameEngine_Common_BulletResObject_skinHitAudios_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_speed_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_trailChromaLuminanceMul_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_unInitPosWhenSameFrame_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_useAppearExposeVision_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_useBulletVisionRule_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_useHitVision_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_useShapeVision_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_useSkillDistanceLimit_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxAttachParent_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxChromaLuminanceMul_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxForceRotateToForward_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxHitEffect_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxHitEffectDuration_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxHitEffectOnTheGround_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxHitUseBulletTowards_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxIgnoreRotation_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxTrailingDelayDeleteTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxTrailingEffect_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_vfxUseVisiHitPosition_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_viewPrecomputedTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_viewRadius_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_visibilityChangesLatencyTime_offset; // 0x0
        int32_t FrameEngine_Common_BulletResObject_waitEnterFieldFrame_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_bJoystickIgnoreCanCast_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_iAfterMoveDeadZoneRadius_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_iButtonFollowsOnDeadzoneExit_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_iButtonNoAim_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_iFaceFocusPoint_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_iFaceFocusPointInDeadZone_offset; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_size; // 0x0
        int32_t FrameEngine_Common_ButtonTemplateResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ChampionAssetObject_resID_offset; // 0x0
        int32_t FrameEngine_Common_ChampionAssetObject_size; // 0x0
        int32_t FrameEngine_Common_ChampionAssetObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ChampionCareerTagResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_ChampionCareerTagResObject_list_offset; // 0x0
        int32_t FrameEngine_Common_ChampionCareerTagResObject_size; // 0x0
        int32_t FrameEngine_Common_ChampionCareerTagResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_aiFilePath_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_aiSelactable_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_assistUseDuration_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_assistUseVariantAttacks_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_attackType_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_baseAttack_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_bodySizeF_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_bornFlow_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_bornFlowVisi_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_bornSkill_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_bVariantAttackAssistEx_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_championExtraTypes_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_championFlag_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_championLaneType_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_championType_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_collisionBoxRadiusF_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_customEvents_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_deathSkill_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_defaultUnlock_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_dieFlow_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_disableLiteFlowCut_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_displayScorePanelBuff_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_fakeDieFlow_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_ffaAddScoreValue_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_gamePointMultiple_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_heroFfaScoreInfoList_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_heroMvpScoreInfoList_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_hpRateHurtMax_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_isHadDisplayScorePanelBuff_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_legoClipNames_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModeAttackSpeedFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModeBasicAttackSpeedGrowthFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModeExtraMoveSpeedFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModeMpOrEnergyFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModeSkillCdFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModeTenacityFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModleBeDamageFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModleDamageFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModleHealingDoneReduced_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_matchModleShieldingDoneReduced_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_model_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_mvpAddScoreValue_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_npcCtrl_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_percentageBeDamageFix_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_positions_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_privateBuffs_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_privateBullets_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_privateMarks_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_privateMonsters_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_privateSkills_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_resourceMaxValueF_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_resourceRegenF_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_resourceType_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_runeReplaces_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_runFlow_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_shared_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_size; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_skillLevelUpRule_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_skills_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_skins_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_switchSkills_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_tagIds_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_talentSkill_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_turningSpeedF_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_unitScaling_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_variables_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_variantSkills_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_vfxOffset_offset; // 0x0
        int32_t FrameEngine_Common_ChampionResObject_vfxScalingF_offset; // 0x0
        int32_t FrameEngine_Common_ChampionTagResObject_id_offset; // 0x0
        int32_t FrameEngine_Common_ChampionTagResObject_list_offset; // 0x0
        int32_t FrameEngine_Common_ChampionTagResObject_size; // 0x0
        int32_t FrameEngine_Common_ChampionTagResObject_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ChantSkillCastParama_chantTimeVar_offset; // 0x0
        int32_t FrameEngine_Common_ChantSkillCastParama_size; // 0x0
        int32_t FrameEngine_Common_ChantSkillCastParama_vfptr_offset; // 0x0
        int32_t FrameEngine_Common_ChargeSkillCastParam_chargeTime_offset; // 0x0
        int32_t FrameEngine_Common_ChargeSkillCastParam_holdTime_offset; // 0x0
